{
    "format": "layers-model",
    "generatedBy": "keras v2.12.0",
    "convertedBy": "TensorFlow.js Converter v4.4.0",
    "modelTopology": {
        "keras_version": "2.12.0",
        "backend": "tensorflow",
        "model_config": {
            "class_name": "Sequential",
            "config": {
                "name": "sequential_1",
                "layers": [
                    {
                        "class_name": "InputLayer",
                        "config": {
                            "batch_input_shape": [
                                null,
                                28,
                                28,
                                1
                            ],
                            "dtype": "float32",
                            "sparse": false,
                            "ragged": false,
                            "name": "conv2d_input"
                        }
                    },
                    {
                        "class_name": "Conv2D",
                        "config": {
                            "name": "conv2d",
                            "trainable": true,
                            "dtype": "float32",
                            "batch_input_shape": [
                                null,
                                28,
                                28,
                                1
                            ],
                            "filters": 32,
                            "kernel_size": [
                                3,
                                3
                            ],
                            "strides": [
                                1,
                                1
                            ],
                            "padding": "valid",
                            "data_format": "channels_last",
                            "dilation_rate": [
                                1,
                                1
                            ],
                            "groups": 1,
                            "activation": "relu",
                            "use_bias": true,
                            "kernel_initializer": {
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": null
                                }
                            },
                            "bias_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        }
                    },
                    {
                        "class_name": "MaxPooling2D",
                        "config": {
                            "name": "max_pooling2d",
                            "trainable": true,
                            "dtype": "float32",
                            "pool_size": [
                                2,
                                2
                            ],
                            "padding": "valid",
                            "strides": [
                                2,
                                2
                            ],
                            "data_format": "channels_last"
                        }
                    },
                    {
                        "class_name": "Conv2D",
                        "config": {
                            "name": "conv2d_1",
                            "trainable": true,
                            "dtype": "float32",
                            "filters": 64,
                            "kernel_size": [
                                3,
                                3
                            ],
                            "strides": [
                                1,
                                1
                            ],
                            "padding": "valid",
                            "data_format": "channels_last",
                            "dilation_rate": [
                                1,
                                1
                            ],
                            "groups": 1,
                            "activation": "relu",
                            "use_bias": true,
                            "kernel_initializer": {
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": null
                                }
                            },
                            "bias_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        }
                    },
                    {
                        "class_name": "MaxPooling2D",
                        "config": {
                            "name": "max_pooling2d_1",
                            "trainable": true,
                            "dtype": "float32",
                            "pool_size": [
                                2,
                                2
                            ],
                            "padding": "valid",
                            "strides": [
                                2,
                                2
                            ],
                            "data_format": "channels_last"
                        }
                    },
                    {
                        "class_name": "Flatten",
                        "config": {
                            "name": "flatten_1",
                            "trainable": true,
                            "dtype": "float32",
                            "data_format": "channels_last"
                        }
                    },
                    {
                        "class_name": "Dense",
                        "config": {
                            "name": "dense_3",
                            "trainable": true,
                            "dtype": "float32",
                            "units": 100,
                            "activation": "relu",
                            "use_bias": true,
                            "kernel_initializer": {
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": null
                                }
                            },
                            "bias_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        }
                    },
                    {
                        "class_name": "Dense",
                        "config": {
                            "name": "dense_4",
                            "trainable": true,
                            "dtype": "float32",
                            "units": 10,
                            "activation": "softmax",
                            "use_bias": true,
                            "kernel_initializer": {
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": null
                                }
                            },
                            "bias_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        }
                    }
                ]
            }
        },
        "training_config": {
            "loss": {
                "class_name": "SparseCategoricalCrossentropy",
                "config": {
                    "reduction": "auto",
                    "name": "sparse_categorical_crossentropy",
                    "from_logits": false,
                    "ignore_class": null
                }
            },
            "metrics": [
                [
                    {
                        "class_name": "MeanMetricWrapper",
                        "config": {
                            "name": "accuracy",
                            "dtype": "float32",
                            "fn": "sparse_categorical_accuracy"
                        }
                    }
                ]
            ],
            "weighted_metrics": null,
            "loss_weights": null,
            "optimizer_config": {
                "class_name": "Custom>Adam",
                "config": {
                    "name": "Adam",
                    "weight_decay": null,
                    "clipnorm": null,
                    "global_clipnorm": null,
                    "clipvalue": null,
                    "use_ema": false,
                    "ema_momentum": 0.99,
                    "ema_overwrite_frequency": null,
                    "jit_compile": false,
                    "is_legacy_optimizer": false,
                    "learning_rate": 0.0010000000474974513,
                    "beta_1": 0.9,
                    "beta_2": 0.999,
                    "epsilon": 1e-07,
                    "amsgrad": false
                }
            }
        }
    },
    "weightsManifest": [
        {
            "paths": [
                "group1-shard2of2.bin"
            ],
            "weights": [
                {
                    "name": "conv2d/kernel",
                    "shape": [
                        3,
                        3,
                        1,
                        32
                    ],
                    "dtype": "float32",
                    "quantization": {
                        "dtype": "uint8",
                        "min": -1.6629856731377395,
                        "scale": 0.009187766149932263,
                        "original_dtype": "float32"
                    }
                },
                {
                    "name": "conv2d/bias",
                    "shape": [
                        32
                    ],
                    "dtype": "float32",
                    "quantization": {
                        "dtype": "uint8",
                        "min": -0.34708121454014496,
                        "scale": 0.0022248795803855447,
                        "original_dtype": "float32"
                    }
                },
                {
                    "name": "conv2d_1/kernel",
                    "shape": [
                        3,
                        3,
                        32,
                        64
                    ],
                    "dtype": "float32",
                    "quantization": {
                        "dtype": "uint8",
                        "min": -1.4705227241796606,
                        "scale": 0.009366386778214398,
                        "original_dtype": "float32"
                    }
                },
                {
                    "name": "conv2d_1/bias",
                    "shape": [
                        64
                    ],
                    "dtype": "float32",
                    "quantization": {
                        "dtype": "uint8",
                        "min": -0.47649719113228367,
                        "scale": 0.002722841092184478,
                        "original_dtype": "float32"
                    }
                },
                {
                    "name": "dense_3/kernel",
                    "shape": [
                        1600,
                        100
                    ],
                    "dtype": "float32",
                    "quantization": {
                        "dtype": "uint8",
                        "min": -1.5874292967366237,
                        "scale": 0.012117780891119265,
                        "original_dtype": "float32"
                    }
                },
                {
                    "name": "dense_3/bias",
                    "shape": [
                        100
                    ],
                    "dtype": "float32",
                    "quantization": {
                        "dtype": "uint8",
                        "min": -0.3544163893250858,
                        "scale": 0.002271899931571063,
                        "original_dtype": "float32"
                    }
                },
                {
                    "name": "dense_4/kernel",
                    "shape": [
                        100,
                        10
                    ],
                    "dtype": "float32",
                    "quantization": {
                        "dtype": "uint8",
                        "min": -1.1919994798361087,
                        "scale": 0.007053251359976974,
                        "original_dtype": "float32"
                    }
                },
                {
                    "name": "dense_4/bias",
                    "shape": [
                        10
                    ],
                    "dtype": "float32",
                    "quantization": {
                        "dtype": "uint8",
                        "min": -0.2998952897155986,
                        "scale": 0.0017235361477907966,
                        "original_dtype": "float32"
                    }
                }
            ]
        }
    ]
}